ergasia5/ergasia5soap/src/main/resources/requestTransferAmount.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:transferAmountRequest>
            <gs:customerName1>Customer 1</gs:customerName1>
            <gs:customerName2>Customer 2</gs:customerName2>
            <gs:amount>500.0</gs:amount>
        </gs:transferAmountRequest>
    </soapenv:Body>
</soapenv:Envelope>